Revit 2026 API

# RibbonItemItemText Property

---

Gets or sets the text displayed on the item.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual string ItemText { get; set; }
```
```vb
Public Overridable Property ItemText As String
	Get
	Set
```
```cpp
public:
virtual property String^ ItemText {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
abstract ItemText : string with get, set
override ItemText : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when setting the text to empty or to the string contains "%". |
| ArgumentNullException | Thrown when setting the text to . |

The text can be changed at run time.  or empty string is not allowed.

#### Reference

RibbonItem Class

Autodesk.Revit.UI Namespace